jax-ws-db/src/main/resources/example/column-get-by-name.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="ua.kiev.unicyb.tcct">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getColumnByNameDtoRequest>
            <gs:databaseName>DB1</gs:databaseName>
            <gs:tableName>TABLE1</gs:tableName>
            <gs:columnName>Name</gs:columnName>
        </gs:getColumnByNameDtoRequest>
    </soapenv:Body>
</soapenv:Envelope>